[
    {
        "name": "Electronics",
        "products": [
            {
                "name": "Samsung Galaxy S23 Ultra",
                "description": "The Samsung Galaxy S23 Ultra is a flagship smartphone featuring a 6.8-inch Dynamic AMOLED 2X display with a 120Hz refresh rate. Powered by the Snapdragon 8 Gen 2 chipset, it offers up to 12GB of RAM and 1TB of storage. The camera setup includes a 200MP primary sensor, a 12MP ultra-wide camera, and dual 10MP telephoto lenses for exceptional zoom capabilities. The device supports 5G, has an IP68 rating for water and dust resistance, and comes with a massive 5,000mAh battery with fast charging.",
                "price": 1199.99,
                "inStock": true
            },
            {
                "name": "Sony WH-1000XM5 Wireless Noise-Canceling Headphones",
                "description": "The Sony WH-1000XM5 is the latest in Sony's renowned line of noise-canceling headphones. These over-ear headphones feature industry-leading noise cancellation, adaptive sound control, and high-resolution audio support. They offer up to 30 hours of battery life on a single charge and have touch controls for music playback and calls. The headphones also support voice assistants like Google Assistant and Alexa. With a sleek design and comfortable fit, they are perfect for long listening sessions.",
                "price": 399.99,
                "inStock": true
            }
        ]
    },
    {
        "name": "Books",
        "products": [
            {
                "name": "\"Atomic Habits\" by James Clear",
                "description": "\"Atomic Habits\" is a best-selling self-help book that explores the science of habit formation and how small changes can lead to remarkable results. James Clear provides practical strategies for building good habits and breaking bad ones, emphasizing the power of tiny, incremental improvements. The book is filled with actionable advice and real-life examples, making it a valuable guide for anyone looking to improve their personal or professional life.",
                "price": 16.99,
                "inStock": true
            },
            {
                "name": "\"Where the Crawdads Sing\" by Delia Owens",
                "description": "\"Where the Crawdads Sing\" is a captivating novel that combines a coming-of-age story with a gripping murder mystery. Set in the marshes of North Carolina, the book follows Kya Clark, the \"Marsh Girl,\" as she grows up in isolation and becomes the prime suspect in a local murder investigation. Delia Owens weaves a tale of survival, love, and resilience, with beautifully descriptive prose that brings the natural world to life. The novel has become a literary sensation, praised for its compelling plot and rich character development.",
                "price": 18.00,
                "inStock": true
            }
        ]
    },
    {
        "name": "Clothing",
        "products": [
            {
                "name": "Levi's 511 Slim Fit Jeans",
                "description": "Levi's 511 Slim Fit Jeans offer a modern, streamlined look while maintaining comfort and mobility. These jeans sit below the waist with a slim fit from the hip to the ankle, making them versatile for both casual and semi-formal wear. Made from durable stretch denim, they come in various washes and colors, providing a perfect balance of style and function. The jeans feature classic five-pocket styling and are designed to retain their shape even after multiple wears.",
                "price": 69.50,
                "inStock": true
            },
            {
                "name": "Nike Dri-FIT Men's Training T-Shirt",
                "description": "The Nike Dri-FIT Men's Training T-Shirt is designed for athletes who demand comfort and performance. Made with Nike's Dri-FIT technology, this shirt wicks away sweat to keep you dry and comfortable during workouts. The lightweight, breathable fabric provides a relaxed fit, allowing for a full range of motion. Available in a variety of colors, this versatile t-shirt is perfect for gym sessions, running, or everyday wear.",
                "price": 25.00,
                "inStock": true
            }
        ]
    },
    {
        "name": "Furniture",
        "products": [
            {
                "name": "IKEA Kallax Shelf Unit",
                "description": "The IKEA Kallax Shelf Unit is a versatile and practical storage solution ideal for any room. With a clean, minimalist design, it features a series of cube-shaped compartments that can be used for organizing books, decorative items, or storage boxes. The unit is made from durable particleboard and is available in various finishes, including white, black-brown, and oak. It can be mounted on the wall or used as a freestanding piece, and its modular design allows for easy customization.",
                "price": 79.99,
                "inStock": true
            },
            {
                "name": "West Elm Mid-Century Dining Table",
                "description": "The West Elm Mid-Century Dining Table brings a touch of elegance and sophistication to your dining space. Inspired by mid-century modern design, it features tapered wooden legs and a sleek, rectangular tabletop. Made from solid wood with a walnut finish, this table is both durable and stylish. It comfortably seats up to six people and complements a variety of decor styles. The table's timeless design ensures it remains a staple in your home for years to come.",
                "price": 899.00,
                "inStock": true
            }
        ]
    }
]